// Task 1

// JavaScript არის პროგრამირების ენა, რომელიც გამოიყენება ვებსაიტების დინამიური შინაარსის შესაქმნელად . ის ამას აღწევს ახალი HTML ელემენტების დამატებით, არსებულის შეცვლით. ბევრი კოდიერი აძლიერებს ვებ განვითარების უნარებს JavaScript-ის გამოყენებით მომხმარებლისთვის მოსახერხებელი და ინტერაქტიული ვებსაიტების შესაქმნელად.


// Task 2

// event არის როდესაც რამე მოვლენა ხდება  მაგალითად: მაუსისის გამოძრავება; ღილაკზე დაჭერა; და ასე შემდეგ.


// Task 3

// JavaScript არის ადინამიური ენადა არა სტატიკური , რაც ნიშნავს, რომ ცვლადებს შეუძლიათ შეინახონ სხვადასხვა ტიპის მნიშვნელობები გაშვების დროს. ენებისგან განსხვავებით, როგორიცაა Typescript ან Java, თქვენ არ გჭირდებათ ცვლადის მონაცემთა ტიპის ცალსახად გამოცხადება.


// Task 4

// var; let; const


// Task 5

// ესკოდი გამოიტანს ერორს რადგან ცვლადები ერთნაირია
// let num = 5;
// let num = 6;


// Task 6

// აქლემის ქეისს სახელი დაარქვეს მისი ამობურცული დიდი ასოს „კეხის“ მიხედვით, ჩვეულებრივი აქლემების კეხის მსგავსი.