#  Task 1

# კლასის მეთოდის იდეა ძალიან ჰგავს ინსტანციის მეთოდს, განსხვავება მხოლოდ იმაში მდგომარეობს, რომ ნაცვლად იმისა, რომ ინსტანცია ფარულად გადავიტანოთ პირველ პარამეტრად, ჩვენ ახლა თავად კლასს გადავცემთ პირველ პარამეტრად.


#  Task 2

# ინსტანციის მეთოდი არის მეთოდები, რომლებიც მოითხოვს მისი კლასის ობიექტის შექმნას მის გამოძახებამდე. სტატიკური მეთოდები არის ჯავის მეთოდები, რომელთა გამოძახება შესაძლებელია კლასის ობიექტის შექმნის გარეშე. სტატიკური მეთოდი გამოცხადებულია სტატიკური საკვანძო სიტყვით. ინსტანციის მეთოდი არ არის სტატიკური საკვანძო სიტყვით.

