//  Task 2

// დოკუმენტის ობიექტის მოდელი მუშაობს ვებგვერდის ხის მსგავსი სტრუქტურის სახით, რომელიც ცნობილია როგორც DOM ხე . ვებგვერდის თითოეული ელემენტი, როგორიცაა აბზაცი ან სურათი, წარმოდგენილია როგორც კვანძი ამ ხეში. ეს იერარქიული წარმოდგენა საშუალებას აძლევს სკრიპტებს ადვილად ნავიგაცია და მანიპულირება ვებგვერდის საშუალებით.

// Task 3

const a = 1
const b = 1

console.log("a" + "b");


// Task 4

// კონსოლი შეიძლება გამოყენებულ იქნას ინფორმაციის ჩასაწერად, როგორც JavaScript-ის განვითარების პროცესის ნაწილი, ასევე საშუალებას მოგცემთ დაუკავშირდეთ ვებგვერდს JavaScript-ის გამონათქვამების განხორციელებით გვერდის კონტექსტში. არსებითად, კონსოლი გაძლევთ შესაძლებლობას დაწეროთ, მართოთ და დააკვირდეთ JavaScript-ს მოთხოვნით.

// Task 5

// Let საკვანძო სიტყვა JavaScript-ში გამოიყენება ბლოკის მასშტაბის ლოკალური ცვლადის გამოსაცხადებლად, სურვილისამებრ მისი ინიციალიზაცია მნიშვნელობით . ეს არის ECMAScript 2015 (ES6) სპეციფიკაციის ნაწილი. Let-ით გამოცხადებულ ცვლადებს აქვთ მათი ფარგლები ბლოკში, რომლისთვისაც ისინი განსაზღვრულია, ისევე როგორც ნებისმიერ შემავალ ქვებლოკში.