#  Task 3

# Instance Method - რა არის: ეს არის მეთოდი, რომელიც დამოკიდებულია კლასის კონკრეტულ ობიექტზე (ინსტანციაზე). როდესაც ჩვენ ვიძახებთ ამ მეთოდს, მას ეძლევა self პარამეტრი, რაც ნიშნავს, რომ ეს მეთოდი მუშაობს კონკრეტული კლასის ინსტანციაზე.

# როდის გამოიყენება: როდესაც მეთოდმა უნდა გამოიყენოს ან შეცვალოს კლასის კონკრეტული ინსტანციის მონაცემები.


# Class Method - რა არის: classmethod არის მეთოდი, რომელიც კლასის დონეზე მუშაობს, არა კონკრეტული ინსტანციის დონეზე. მას ეძლევა cls პარამეტრი, რომელიც მიუთითებს კლასზე, და არა ინსტანციაზე.

# როდის გამოიყენება: როდესაც საჭიროა სამუშაო კლასის დონეზე, ზოგჯერ კლასი თავად უნდა შეასრულოს გარკვეული მოქმედებები ან დააწესოს ქცევა.


# Static Method - რა არის: staticmethod არის მეთოდი, რომელიც არ იღებს არც self, არც cls პარამეტრებს. ეს მეთოდი გამოიყენება, როდესაც საჭიროა ფუნქციონალობა, რომელიც არ არის დამოკიდებული არც კლასის, არც მისი ინსტანციის მონაცემებზე.

# როდის გამოიყენება: როდესაც ვიღებთ რაიმე "თავისუფალ" ფუნქციას, რომელიც არ უნდა იყოს დაკავშირებული არანაირ კლასურ კონტექსტთან.


# საბოლოო დასკვნა:

# classmethod და staticmethod ხშირად გამოიყენება უფრო ორგანიზებული და გაწერილი ლოგიკისთვის, მაშინ როცა instance method ჩვეულებრივ გამოიყენება, როდესაც საჭიროა კონკრეტული ობიექტის მონაცემების მართვა.
