# task 1: შექმენით 2 ცვლადი, გაზარდეთ პირველის მნიშვნელობა ერთით (reassign'ის გამოყენებით) და გამოიტანეთ ტერმინალში

num = 5
num = num + 1

print(num)

# task 2: კომენტარის სახით, თქვენი სიტყვებით ახსენით რა არის მნიშვნელობის გადაწერა

# მნიშვენლობის გადაწერა ხდება როდესაც ერთიდაიგივე ცვლადის სახელს,ერჯერ ან მეტჯერ ვანიჭებთ მნიშვნელობას

# მაგალითად აქ num1'ს თავდაპირველად მიენიჭა მნიშვნელობა 5 და გადაწერის შემდეგ გახდა 6
num1 = 5
num1 = 6

# task 3: შექმენით ორი ცვლადი, balance და discount, ასევე შექმენით კიდევ ერთი ცვლადი სადაც იქნება საბოლოო ფასი და გამოიტანეთ ტერმინალში

balance = 100
discount = 20
total = balance - discount

print(total)



